Docs overhauled
